of-develop/twoDimensions/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      k;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.001;
boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0.001;
    }
    face1
    {
        type zeroGradient;
    }
    face2
    {
        type zeroGradient;
    }
    face3
    {
        type zeroGradient;
    }
    face4
    {
        type zeroGradient;
    }
    face5
    {
        type zeroGradient;
    }
    face6
    {
        type zeroGradient;
    }
    face7
    {
        type zeroGradient;
    }
    face9
    {
        type zeroGradient;
    }
    outlet
    {
        type inletOutlet;
        inletValue uniform 0.001;
        value uniform 0.001;
    }
}
