of-develop/twoDimensions/0/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    0;
    object      p;
}
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0.0;
boundaryField
{
    inlet
    {
        type zeroGradient;
    }
    face1
    {
        type zeroGradient;
    }
    face2
    {
        type zeroGradient;
    }
    face3
    {
        type zeroGradient;
    }
    face4
    {
        type zeroGradient;
    }
    face5
    {
        type zeroGradient;
    }
    face6
    {
        type zeroGradient;
    }
    face7
    {
        type zeroGradient;
    }
    face9
    {
        type zeroGradient;
    }
    outlet
    {
        type totalPressure;
        p0 uniform 0;
        value uniform 0;
    }
}
