of-develop/twoDimensions/system/blockMeshDict
FoamFile
{
  version 2.0;
  format  ascii;
  class   dictionary;
  object  blockMeshDict;
}
vertices
(
  (-0.11000000000000001 -0.0001 -0.05)
  (1.2100000000000002 -0.0001 -0.05)
  (1.2100000000000002 0.0011 -0.05)
  (-0.11000000000000001 0.0011 -0.05)
  (-0.11000000000000001 -0.0001 0.55)
  (1.2100000000000002 -0.0001 0.55)
  (1.2100000000000002 0.0011 0.55)
  (-0.11000000000000001 0.0011 0.55)
);
blocks
(
  hex (0 1 2 3 4 5 6 7) (290 1 132) simpleGrading (1 1 1)
);
edges ();
patches ();
mergePatchPairs ();
