of-develop/twoDimensions/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
  face1.stl
  {
    type triSurfaceMesh;
    name face1;
    regions
    {
      face1
      {
        name face1;
      }
    }
  }
  face2.stl
  {
    type triSurfaceMesh;
    name face2;
    regions
    {
      face2
      {
        name face2;
      }
    }
  }
  face3.stl
  {
    type triSurfaceMesh;
    name face3;
    regions
    {
      face3
      {
        name face3;
      }
    }
  }
  face4.stl
  {
    type triSurfaceMesh;
    name face4;
    regions
    {
      face4
      {
        name face4;
      }
    }
  }
  face5.stl
  {
    type triSurfaceMesh;
    name face5;
    regions
    {
      face5
      {
        name face5;
      }
    }
  }
  face6.stl
  {
    type triSurfaceMesh;
    name face6;
    regions
    {
      face6
      {
        name face6;
      }
    }
  }
  face7.stl
  {
    type triSurfaceMesh;
    name face7;
    regions
    {
      face7
      {
        name face7;
      }
    }
  }
  face9.stl
  {
    type triSurfaceMesh;
    name face9;
    regions
    {
      face9
      {
        name face9;
      }
    }
  }
  inlet.stl
  {
    type triSurfaceMesh;
    name inlet;
    regions
    {
      inlet
      {
        name inlet;
      }
    }
  }
  outlet.stl
  {
    type triSurfaceMesh;
    name outlet;
    regions
    {
      outlet
      {
        name outlet;
      }
    }
  }
  box0
  {
    type searchableBox;
    // Error epsilon is added/subtracted for stability.
    min (-1e-09 -1e-09 -1e-09);
    max (1.1000000010000002 1.000000001 0.500000001);
  }
}
castellatedMeshControls
{
  features (
    {
      file "face1.eMesh";
      level 1;
    }
    {
      file "face2.eMesh";
      level 1;
    }
    {
      file "face3.eMesh";
      level 1;
    }
    {
      file "face4.eMesh";
      level 1;
    }
    {
      file "face5.eMesh";
      level 1;
    }
    {
      file "face6.eMesh";
      level 1;
    }
    {
      file "face7.eMesh";
      level 1;
    }
    {
      file "face9.eMesh";
      level 1;
    }
    {
      file "inlet.eMesh";
      level 1;
    }
    {
      file "outlet.eMesh";
      level 1;
    }
  );
  refinementSurfaces
  {
    face1
    {
      level (0 0);
      regions
      {
        face1
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face2
    {
      level (0 0);
      regions
      {
        face2
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face3
    {
      level (0 0);
      regions
      {
        face3
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face4
    {
      level (0 0);
      regions
      {
        face4
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face5
    {
      level (0 0);
      regions
      {
        face5
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face6
    {
      level (0 0);
      regions
      {
        face6
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face7
    {
      level (0 0);
      regions
      {
        face7
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    face9
    {
      level (0 0);
      regions
      {
        face9
        {
          level (0 0);
          patchInfo
          {
            type wall;
          }
        }
      }
    }
    inlet
    {
      level (0 0);
      regions
      {
        inlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
    outlet
    {
      level (0 0);
      regions
      {
        outlet
        {
          level (0 0);
          patchInfo
          {
            type patch;
          }
        }
      }
    }
  }
  refinementRegions
  {
    box0
    {
      mode inside;
      levels ((1 1));
    }
  }
  locationInMesh (0.55 0.0005 0.25);
  maxLocalCells 100000000;
  maxGlobalCells 100000000;
  minRefinementCells 1;
  nCellsBetweenLevels 3;
  resolveFeatureAngle 30;
  allowFreeStandingZoneFaces false;
}
snapControls
{
  nSolveIter 30;
  nSmoothPatch 3;
  tolerance 4.0;
  nRelaxIter 5;
  nFeatureSnapIter 10;
}
addLayersControls
{
  layers
  {
  }
  relativeSizes true;
  expansionRatio 1.0;
  finalLayerThickness 0.3;
  minThickness 0.03;
  nGrow 1;
  featureAngle 60;
  nRelaxIter 5;
  nSmoothSurfaceNormals 1;
  nSmoothNormals 3;
  nSmoothThickness 10;
  maxFaceThicknessRatio 0.5;
  maxThicknessToMedialRatio 0.3;
  minMedianAxisAngle 130;
  nBufferCellsNoExtrude 0;
  nLayerIter 50;
  nRelaxedIter 20;
}
meshQualityControls
{
  maxNonOrtho 65;
  maxBoundarySkewness 20;
  maxInternalSkewness 4;
  maxConcave 80;
  minFlatness 0.5;
  minVol 1.00E-13;
  minTetQuality -1e30;
  minArea -1;
  minTwist 0.05;
  minDeterminant 0.001;
  minFaceWeight 0.05;
  minVolRatio 0.01;
  minTriangleTwist -1;
  nSmoothScale 4;
  errorReduction 0.75;
  relaxed
  {
    maxNonOrtho 180;
  }
}
debug 0;
mergeTolerance 1e-5;
